---
type: Location
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# Location

`Autodesk.Revit.DB.Location` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Move | — | `public bool Move ( XYZ translation )` |
| Method | Rotate | — | `public bool Rotate ( Line axis , double angle )` |